## Pandas And Numpy

In [5]:
# importing the pandas and numpy library
import pandas as pd
import numpy as np
from io import StringIO

In [23]:
# import data in pandas dataframe
df = pd.read_csv(r"C:\Users\HP\Downloads\Messy data set.csv")
df

     ID     Name         Age               Email    JoinDate    Salary
0     1    Alice          25   alice@example.com  2020-01-01     50000
1     2      Bob          30     bob@example.com  not a date     60000
2     2      Bob          30     bob@example.com  2020-02-01     60000
3     4  Charlie         NaN            charlie@  2020-03-01     70000
4     5    David  Twenty-two                 NaN  2020-04-01       NaN
5     6      Eve          45         eve@example  2020-05-01     90000
6     7    Frank          50  frank@@example.com  2020/06/01    100000
7     8    Grace          55   grace@example.com  01-07-2020  one lakh
8  nine    Heidi          60   heidi@example.com  2020.08.01    120000
9    10      NaN          65      10@example.com  2020-09-01    130000

In [24]:
# changing the data type of id,age,salary
df['ID'] = pd.to_numeric(df['ID'], errors='coerce')
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')
df

     ID     Name   Age               Email    JoinDate    Salary
0   1.0    Alice  25.0   alice@example.com  2020-01-01   50000.0
1   2.0      Bob  30.0     bob@example.com  not a date   60000.0
2   2.0      Bob  30.0     bob@example.com  2020-02-01   60000.0
3   4.0  Charlie   NaN            charlie@  2020-03-01   70000.0
4   5.0    David   NaN                 NaN  2020-04-01       NaN
5   6.0      Eve  45.0         eve@example  2020-05-01   90000.0
6   7.0    Frank  50.0  frank@@example.com  2020/06/01  100000.0
7   8.0    Grace  55.0   grace@example.com  01-07-2020       NaN
8   NaN    Heidi  60.0   heidi@example.com  2020.08.01  120000.0
9  10.0      NaN  65.0      10@example.com  2020-09-01  130000.0

In [25]:
# data type
df.dtypes

ID          float64
Name         object
Age         float64
Email        object
JoinDate     object
Salary      float64
dtype: object

In [26]:
# missing values
df.isnull().sum()

ID          1
Name        1
Age         2
Email       1
JoinDate    0
Salary      2
dtype: int64

In [29]:
# fill missing values of age and salary
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())
df

     ID     Name   Age               Email    JoinDate    Salary
0   1.0    Alice  25.0   alice@example.com  2020-01-01   50000.0
1   2.0      Bob  30.0     bob@example.com  not a date   60000.0
2   2.0      Bob  30.0     bob@example.com  2020-02-01   60000.0
3   4.0  Charlie  45.0            charlie@  2020-03-01   70000.0
4   5.0    David  45.0                 NaN  2020-04-01   85000.0
5   6.0      Eve  45.0         eve@example  2020-05-01   90000.0
6   7.0    Frank  50.0  frank@@example.com  2020/06/01  100000.0
7   8.0    Grace  55.0   grace@example.com  01-07-2020   85000.0
8   NaN    Heidi  60.0   heidi@example.com  2020.08.01  120000.0
9  10.0      NaN  65.0      10@example.com  2020-09-01  130000.0

In [32]:
# remove rows with missing values
df.dropna(inplace=True)
df

    ID     Name   Age               Email    JoinDate    Salary
0  1.0    Alice  25.0   alice@example.com  2020-01-01   50000.0
1  2.0      Bob  30.0     bob@example.com  not a date   60000.0
2  2.0      Bob  30.0     bob@example.com  2020-02-01   60000.0
3  4.0  Charlie  45.0            charlie@  2020-03-01   70000.0
5  6.0      Eve  45.0         eve@example  2020-05-01   90000.0
6  7.0    Frank  50.0  frank@@example.com  2020/06/01  100000.0
7  8.0    Grace  55.0   grace@example.com  01-07-2020   85000.0